IMProject/IMBootloader/Middlewares/ST/STM32_ExtMem_Manager/nor_sfdp/stm32_sfdp_data.c
/**
  ******************************************************************************
  * @file    stm32_sfdp_data.c
  * @author  MCD Application Team
  * @brief   This file includes a driver for SFDP support
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32_extmem_conf.h"

#if defined(EXTMEM_DRIVER_NOR_SFDP) && (EXTMEM_DRIVER_NOR_SFDP == 1)
#include "stm32_sfdp_driver_api.h"
#include "stm32_sfdp_data.h"
#if EXTMEM_DRIVER_NOR_SFDP_DEBUG_LEVEL != 0 && defined(EXTMEM_MACRO_DEBUG)
#include <stdio.h>
#endif /* EXTMEM_DRIVER_NOR_SFDP_DEBUG_LEVEL != 0 && defined(EXTMEM_MACRO_DEBUG) */
#include <string.h>

/** @defgroup NOR_SFDP_DATA Data module
  * @ingroup NOR_SFDP
  * @{
  */

/* Private defines ------------------------------------------------------------*/
/** @defgroup NOR_SFDP_DATA_Private_define Private defines
  * this group contains all the private define of the sfdp data module.
  * @{
  */

/** @brief true definition
 *
 * definition of the reset method
 */
  typedef enum {
    RESET_NONE,
    RESET_Fh_4DATA_8CLOCK,
    RESET_Fh_4DATA_10CLOCK,
    RESET_Fh_4DATA_16CLOCK,
    RESET_INSTRUCTION_F0,
    RESET_INSTRUCTION_66_99,
    RESET_ERROR
  } RESET_METHOD;

/** @brief true definition
 *
 * definition of the value true and false
 */
#define EXTMEM_SFDP_TRUE  1u      /**< true value */

/** @brief false definition
 *
 * definition of the value true and false
 */
#define EXTMEM_SFDP_FALSE 0u      /**< false value */

/** @brief address none definition
 *
 * definition of the value to detect no address management case
 */
#define EXTMEM_ADDRESS_NONE 0xFFu      /**< no address management */

/**
 * @brief clock definition 200Mhz
 */
#define CLOCK_200MHZ   200000000u
/**
 * @brief clock definition 166Mhz
 */
#define CLOCK_166MHZ   166000000u
/**
 * @brief clock definition 133Mhz
 */
#define CLOCK_133MHZ   133000000u
/**
 * @brief clock definition 100Mhz
 */
#define CLOCK_100MHZ   100000000u

/**
 * @brief SFDP signature
 */
#define SFDP_SIGNATURE                0x50444653U
#define SFDP_SIGNATURE_INVERTED       0x44505346U
/**
 * @brief SFDP header size
 */
#define SFDP_HEADER_SIZE              8U

/**
 * @brief SFDP param header size
 */
#define SFDP_PARAM_HEADER_SIZE        8U

/**
 * @brief SFDP basic table default size
 */
#define SFDP_PARAMS_BASIC_TABLE_DEFAULTSIZE  23u

/**
 * @brief SFDP Basic Parameter Table (MSB and LSB)
 */
#define SFDP_BASIC_PARAMETER_TABLE_MSB    0xFFU
#define SFDP_BASIC_PARAMETER_TABLE_LSB    0x00U

/**
 * @brief DEBUG macro string
 */
#if EXTMEM_DRIVER_NOR_SFDP_DEBUG_LEVEL > 3 && defined(EXTMEM_MACRO_DEBUG)
#define SFDP_DEBUG_STR(_STR_)     do{                              \
                                  EXTMEM_MACRO_DEBUG("\t\tSFDP::");\
                                  EXTMEM_MACRO_DEBUG(_STR_);       \
                                  EXTMEM_MACRO_DEBUG("\n");        \
                              }while(0);
#else
#define SFDP_DEBUG_STR(_STR_)
#endif /* */

/**
 * @brief DEBUG macro string + integer value
 */
#if EXTMEM_DRIVER_NOR_SFDP_DEBUG_LEVEL > 3 && defined(EXTMEM_MACRO_DEBUG)
#define SFDP_DEBUG_INT(_STR_,_INT_) do {                                          \
                                   char int_char[50];                             \
                                   EXTMEM_MACRO_DEBUG("\t\tSFDP::");              \
                                   (void)sprintf(int_char,"%s0x%x",_STR_, _INT_); \
                                   EXTMEM_MACRO_DEBUG((uint8_t *)int_char);       \
                                   EXTMEM_MACRO_DEBUG("\n");                      \
                              }while(0);
#else
#define SFDP_DEBUG_INT(_STR_,_INT_)
#endif

/**
 * @brief DEBUG macro for function call
 */
#define CHECK_FUNCTION_CALL(_FUNC_)  do{                         \
                                     retr = _FUNC_;              \
                                     if ( EXTMEM_SFDP_OK != retr)\
                                     {                           \
                                       goto error;               \
                                     }                           \
                                     }while(0);

/**
  * @}
  */

/* Private typedefs ---------------------------------------------------------*/
/** @defgroup NOR_SFDP_DATA_Private_TypeDefs Private typedefs
  * @{
  */

/**
 * @brief Memory link configuration
 */
typedef struct {
  SAL_XSPI_PhysicalLinkTypeDef PhyLink;
  uint8_t                      DummyCycle;
} TableConfig_Typedef;


/**
 * @brief SFDP header definition
 */
typedef struct {
  uint8_t ID_lsb;                 /*!< ID lsb */
  uint8_t Minor_revision;         /*!< minor revision */
  uint8_t Major_revision;         /*!< major revision */
  uint8_t Length;                 /*!< Length */
  uint8_t TableAddressPointer[3]; /*!< address of the table pointer */
  uint8_t ID_msb;                 /*!< ID msb */
} SFDP_ParameterHeaderTypeDef;

/**
 * @brief SFDP param definition
 */
typedef struct {
  SFDP_ParamID_TypeDef type;  /*!< list of the param table available */
  uint32_t address;           /*!< address of the table */
  uint8_t size;               /*!< size of the table */
} SFDP_ParameterTableTypeDef;

/**
 * @brief SFDP JEDEC Basic Params definition
 */
typedef struct {
  uint32_t size;
  union {
    uint8_t data_BYTE[23*4];  /*!< data in bytes format */
    uint32_t data_DWORD[23];  /*!< data in DWORD format */
    struct {
      struct {
      uint32_t BlockSectorEraseSizes:2;
      uint32_t WriteGranularity:1;
      uint32_t VolatileRegisterProtect:1;
      uint32_t WriteEnableInstructionVolatileRegister:1;
      uint32_t :3;
      uint32_t _4KEraseInstruction:8;
      uint32_t Support_1S1S2SFastRead:1;
      uint32_t AddressBytes:2;
      uint32_t Support_DTR:1;
      uint32_t Support_1S2S2SFastRead:1;
      uint32_t Support_1S4S4SFastRead:1;
      uint32_t Support_1S1S4SFastRead:1;
      uint32_t :8;
      } D1;
      struct {
        uint32_t FlashSize;
      } D2;

      /* Fast read */
      struct {
        uint32_t _1S4S4S_DummyClock:5;
        uint32_t _1S4S4S_ModeClock:3;
        uint32_t _1S4S4S_FastReadInstruction:8;
        uint32_t _1S1S4S_DummyClock:5;
        uint32_t _1S1S4S_ModeClock:3;
        uint32_t _1S1S4S_FastReadInstruction:8;
      } D3;
      struct {
        uint32_t _1S1S2S_DummyClock:5;
        uint32_t _1S1S2S_ModeClock:3;
        uint32_t _1S1S2S_FastReadInstruction:8;
        uint32_t _1S2S2S_DummyClock:5;
        uint32_t _1S2S2S_ModeClock:3;
        uint32_t _1S2S2S_FastReadInstruction:8;
      } D4;
      struct {
        uint32_t _2S2S2S_FastReadSupport:1;
        uint32_t :3;
        uint32_t _4S4S4S_FastReadSupport:1;
        uint32_t :27;
      } D5;
      struct {
      uint32_t :16;
      uint32_t _2S2S2S_DummyClock:5;
      uint32_t _2S2S2S_ModeClock:3;
      uint32_t _2S2S2S_FastReadInstruction:8;
      } D6;
      struct {
      uint32_t :16;
      uint32_t _4S4S4S_DummyClock:5;
      uint32_t _4S4S4S_ModeClock:3;
      uint32_t _4S4S4S_FastReadInstruction:8;
      } D7;

