IMProject/IMBootloader/Middlewares/ST/STM32_ExtMem_Manager/nor_sfdp/stm32_sfdp_data.c
      /* Erase */
      struct {
        uint32_t EraseType1_Size:8;
        uint32_t EraseType1_Instruction:8;
        uint32_t EraseType2_Size:8;
        uint32_t EraseType2_Instruction:8;
      } D8;
      struct {
        uint32_t EraseType3_Size:8;
        uint32_t EraseType3_Instruction:8;
        uint32_t EraseType4_Size:8;
        uint32_t EraseType4_Instruction:8;
      } D9;

      /* Timing */
      struct {
        uint32_t MutliplierEraseTime:4;
        uint32_t EraseType1_TypicalTime_count:5;
        uint32_t EraseType1_TypicalTime_units:2;
        uint32_t EraseType2_TypicalTime_count:5;
        uint32_t EraseType2_TypicalTime_units:2;
        uint32_t EraseType3_TypicalTime_count:5;
        uint32_t EraseType3_TypicalTime_units:2;
        uint32_t EraseType4_TypicalTime_count:5;
        uint32_t EraseType4_TypicalTime_units:2;
      } D10;
      struct {
        uint32_t MutliplierProgamTime:4;
        uint32_t PageSize:4;
        uint32_t PageProgram_TypicalTime:6;
        uint32_t ByteProgram_TypicalTime:5;
        uint32_t AddByteProgram_TypicalTime:5;

        uint32_t ChipErase_TypicalTime_count:5;   /* 28:24 count */
        uint32_t ChipErase_TypicalTime_units:2;   /* 30:29 units (00b: 16 ms, 01b: 256 ms, 10b: 4 s, 11b: 64 s) */

      uint32_t :1;
      } D11;
      struct {
        uint32_t ProhibitedOpDuringProgramSuspend:4;
        uint32_t ProhibitedOpDuringEraseSuspend:4;
      uint32_t :1;
      uint32_t ProgramResumeToSuspendInterval:4;
      uint32_t SuspendInProgress_ProgramMaxLatency:7;
      uint32_t EraseResumeToSuspendInterval:4;
      uint32_t SuspendInProgress_EraseMaxLatency:7;
      uint32_t :1;
      } D12;
      struct {
        uint32_t ProgramResume_Intruction:8;
        uint32_t ProgramSuspend_Intruction:8;
        uint32_t Resume_Intruction:8;
        uint32_t Suspend_Intruction:8;
      } D13;
      struct {
      uint32_t :2;
      uint32_t StatusRegister:6;
      uint32_t ExitDeepPowerdownDelay:7;
      uint32_t ExitDeepPowerdown_Instruction:8;
      uint32_t EnterDeepPowerdown_Instruction:8;
      uint32_t DeepPowerdown_Support:1;
      } D14;
      struct {
        uint32_t _4S4S4S_DisableSequence:4;
        uint32_t _4S4S4S_EnableSequence:5;
        uint32_t _0S4S4S_Support:1;
        uint32_t _0S4S4S_ExitMethod:6;
        uint32_t _0S4S4S_EntryMethod:4;
        uint32_t QuadEnableRequirement:3;
        uint32_t HoldORReset_Disable:1;
      uint32_t :8;
      } D15;
      struct {
        uint32_t VolatileNonVolatileRegister_WriteEnable:7;
        uint32_t :1;
        uint32_t SoftResetRescueSequence_Support:6;
        uint32_t Exit4ByteAddressing:10;
        uint32_t Enter4ByteAddressing:8;
      } D16;
      /* Added one for octal management, this part depends on the information size of the flash device */
      struct {
        uint32_t _1S8S8S_DummyClock:5;
        uint32_t _1S8S8S_ModeClock:3;
        uint32_t _1S8S8S_FastReadInstruction:8;
        uint32_t _1S1S8S_DummyClock:5;
        uint32_t _1S1S8S_ModeClock:3;
        uint32_t _1S1S8S_FastReadInstruction:8;
      } D17;
      struct {
      uint32_t :18;
      uint32_t VariableOutputDriverStrength:5;
      uint32_t JEDECSPIProtocolReset:1;
      uint32_t DataStrobeSTRMode:2;
      uint32_t DataSTrobeQPISTRMode:1;
      uint32_t DataSTrobeQPIDTRMode:1;
      uint32_t :1;
      uint32_t OctalDTRCommandExtension:2;
      uint32_t OctalByteOrder:1;
      } D18;
      struct {
        uint32_t _8s8s8s_DisableSequence:4;
        uint32_t _8s8s8s_EnableSequence:5;
        uint32_t _8S8S8S_Support:1;
        uint32_t _8S8S8S_ExitMethod:6;
        uint32_t _8S8S8S_EnterMethod:4;
        uint32_t OctalRequirement:3;
      uint32_t :9;
      } D19;
      struct {
        uint32_t _4S4S4S_MaximunSpeedWithoutStrobe:4; /* 1111b: not supported, 1110b: not characterized , 1010b: Reserved
                                                         1100b: 400 MHz*, 1011b: 333 MHz*, 1010b: 266 MHz*, 1001b: 250 MHz*
                                                         1000b: 200 MHz,  0111b: 166 MHz,  0110b: 133 MHz , 0101b: 100 MHz
                                                         0100b: 80 MHz,   0011b: 66 MHz ,  0010b: 50 MHz  , 0001b: 33 MHz */
        uint32_t _4S4S4S_MaximunSpeedWithStrobe:4;
        uint32_t _4S4D4D_MaximunSpeedWithoutStrobe:4;
        uint32_t _4S4D4D_MaximunSpeedWithStrobe:4;
        uint32_t _8S8S8S_MaximunSpeedWithoutStrobe:4;
        uint32_t _8S8S8S_MaximunSpeedWithStrobe:4;
        uint32_t _8D8D8D_MaximunSpeedWithoutStrobe:4;
        uint32_t _8D8D8D_MaximunSpeedWithStrobe:4;
      } D20;
      struct {
        uint32_t _1S1D1D_FastReadSupport:1;
        uint32_t _1S2D2D_FastReadSupport:1;
        uint32_t _1S4D4D_FastReadSupport:1;
        uint32_t _4S4D4D_FastReadSupport:1;
      uint32_t :28;
      } D21;
      struct {
        uint32_t _1S1D1D_DummyClock:5;
        uint32_t _1S1D1D_ModeClock:3;
        uint32_t _1S1D1D_FastReadInstruction:8;
        uint32_t _1S2D2D_DummyClock:5;
        uint32_t _1S2D2D_ModeClock:3;
        uint32_t _1S2D2D_FastReadInstruction:8;
      } D22;
      struct {
        uint32_t _1S4D4D_DummyClock:5;
        uint32_t _1S4D4D_ModeClock:3;
        uint32_t _1S4D4D_FastReadInstruction:8;
        uint32_t _4S4D4D_DummyClock:5;
        uint32_t _4S4D4D_ModeClock:3;
        uint32_t _4S4D4D_FastReadInstruction:8;
      } D23;
    }Param_DWORD;
  } Params;
}SFDP_JEDECBasic_Params;

/**
 * @brief SFDP JEDEC 4ByteAddress Params definition
 */
typedef union {
  uint8_t data_BYTE[2*4]; /*!< data in BYTE format */
  uint32_t data_DWORD[2]; /*!< data in DWORD format */
  struct {
    struct {
      uint32_t Support_1S1S1S_ReadCommand:1;       /*!< Instruction=13h */
      uint32_t Support_1S1S1S_FastReadCommand:1;   /*!< Instruction=0Ch */
      uint32_t Support_1S1S2S_FastReadCommand:1;   /*!< Instruction=3Ch */
      uint32_t Support_1S2S2S_FastReadCommand:1;   /*!< Instruction=BCh */
      uint32_t Support_1S1S4S_FastReadCommand:1;   /*!< Instruction=6Ch */
      uint32_t Support_1S4S4S_FastReadCommand:1;   /*!< Instruction=ECh */
      uint32_t Support_1S1S1S_PageProgramCommand:1;/*!< Instruction=12h */
      uint32_t Support_1S1S4S_PageProgramCommand:1;/*!< Instruction=34h */
      uint32_t Support_1S4S4S_PageProgramCommand:1;/*!< Instruction=3Eh */
      uint32_t Support_EraseCommandType1size:1;    /*!< support of erase type1 */
      uint32_t Support_EraseCommandType2size:1;    /*!< Instruction lookup in next Dword */
      uint32_t Support_EraseCommandType3size:1;    /*!< Instruction lookup in next Dword */
      uint32_t Support_EraseCommandType4size:1;    /*!< Instruction lookup in next Dword */
      uint32_t Support_1S1D1D_DTRReadCommand:1;    /*!< Instruction=0Eh */
      uint32_t Support_1S2D2D_DTRReadCommand:1;    /*!< Instruction=BEh */
      uint32_t Support_1S4D4D_DTRReadCommand:1;    /*!< Instruction=EEh */
      uint32_t Support_VolatileIndividualSectorLockReadCommand:1;  /* Instruction=E0h */
      uint32_t Support_VolatileIndividualSectorLockWriteCommand:1; /* Instruction=E1h */
      uint32_t Support_NVolatileIndividualSectorLockReadCommand:1; /* Instruction=E2h */
      uint32_t Support_NVolatileIndividualSectorLockWriteCommand:1;/* Instruction=E3h */
      uint32_t Support_1S1S8S_FastReadCommand:1;   /* Instruction=7Ch */
      uint32_t Support_1S8S8S_FastReadCommand:1;   /* Instruction=CCh */
      uint32_t Support_1S8D8D_DTRReadCommand:1;    /* Instruction=FDh */
      uint32_t Support_1S1S8S_PageProgramCommand:1;/* Instruction=84h */
      uint32_t Support_1S8S8S_PageProgramCommand:1;/* Instruction=8Eh */
      uint32_t :7;
    }D1;
    struct {
      uint32_t InstructionEraseType1:8;  /* common usage is:21h for   4 kbyte erase*/
      uint32_t InstructionEraseType2:8;  /* common usage is:5Ch for  32 kbyte erase*/
      uint32_t InstructionEraseType3:8;  /* common usage is:DCh for  64 kbyte erase*/
      uint32_t InstructionEraseType4:8;  /* common usage is:DCh for 256 kbyte erase*/
    }D2;
  }Param_DWORD;
} SFDP_JEDEC4ByteAddress_Params;


/**
 * @brief SFDP JEDEC XSPI10 Params definition
 */
typedef union {
  uint8_t  data_BYTE[6*4];     /*!< data in BYTE format */
  uint32_t data_DWORD[6];      /*!< data in DWORD format */
  struct {
    /* Command Codes used in 8D-8D-8D protocol mode */
    struct {
      uint32_t ReadFastWrapCommand:8; /* 0 means not supported */
      uint32_t ReadFastCommand:8;
      uint32_t :6;
      uint32_t NumberOfDataBytesForWriteRegisterCommand:1;
      uint32_t NumberOfAdditionnalModifierBytesForWriteRegisterCommand:1;
      uint32_t NumberOfAdditionnalModifierBytesForStatusConfigRegisterCommand:1;
      uint32_t InitialLaLatencyForReadNonVolatileRegisterCommand:1;
      uint32_t InitialLatencyForReadVolatileRegisterCommand:1;
      uint32_t NumberOfAdditionalModifierBytesForReadRegisterCommand:1;
      uint32_t InitialLatencyForReadStatusRegisterCommand:1;
      uint32_t NumberOfAdditionalModifierBytesForReadStatusRegisterCommand:1;
      uint32_t SFDPCommand_8D8D8DMode_DummyCycles:1;
      uint32_t SFDPCommand_8D8D8DMode_AddressBytes:1;
    } D1;
    /* Commands Codes used in 8D-8D-8D protocol mode */
    struct {
      uint32_t WriteNVolatileRegisterCommand:8;
      uint32_t WriteVolatileRegisterCommand:8;
      uint32_t ReadNVolatileRegisterCommand:8;
      uint32_t ReadVolatileRegisterCommand:8;
    } D2;
    /* Memory Commands in 8D-8D-8D protocol mode */
    struct {
      uint32_t :10;
      uint32_t EnterDefaultProtocolMode_support:1;
      uint32_t SoftResetAndEnterDefaultProtocolMode_support:1;
      uint32_t ResetEnable_support:1;
      uint32_t SoftReset_support:1;
      uint32_t ExitDeepPowerDown_support:1;
      uint32_t EnterDeepPowerDown_support:1;
      uint32_t WriteNVolatileRegister_support:1;
      uint32_t WriteVolatileRegister_support:1;
      uint32_t WriteRegister_support:1;
      uint32_t ClearFlagStatusReg_support:1;
      uint32_t WriteStatusConfigurationRegister_support:1;
      uint32_t ReadNVolatileRegister_support:1;
      uint32_t ReadVolatileRegister_support:1;
      uint32_t ReadRegister_support:1;
      uint32_t ReadFlagStatusRegister_support:1;
      uint32_t ReadConfigurationRegister_support:1;
      uint32_t EraseChip_support:1;
      uint32_t Erase_32Kbytes_support:1;
      uint32_t Erase_4Kbytes_support:1;
      uint32_t SetupReadWrap_support:1;
      uint32_t ReadFastWrap_support:1;
      uint32_t ReadSFDP_8D8D8D:1;
    } D3;  /* this naming to be aligned with the specification */
    /* Dummy cycles used for various frequencies */
    struct {
      uint32_t :2;
      uint32_t Operation200Mhz_ConfigPattern:5;
      uint32_t Operation200Mhz_DummyCycle:5;
      uint32_t :20;
    } D4;
    /* Dummy cycles used for various frequencies */
    struct {
      uint32_t :2;
      uint32_t Operation100Mhz_ConfigPattern:5;
      uint32_t Operation100Mhz_DummyCycle:5;
      uint32_t Operation133Mhz_ConfigPattern:5;
      uint32_t Operation133Mhz_DummyCycle:5;
      uint32_t Operation166Mhz_ConfigPattern:5;
      uint32_t Operation166Mhz_DummyCycle:5;
    } D5;
    /* Default Dummy cycles after POR */
    struct {
      uint32_t _8D8D8DDefaultPOR_DummyCycle:5;
      uint32_t _8S8S8SDefaultPOR_DummyCycle:5;
      uint32_t :22;
    } D6;

  } Param_DWORD;
} SFDP_JEDEC_XSPI10; /* contains the command codes used in 8D-8D-8D protocol mode */

/**
 * @brief SFDP JEDEC octal ddr params definition
 */
typedef union {
  uint8_t  data_BYTE[8*4]; /*!< data in BYTE format */
  uint32_t data_DWORD[8];  /*!< data in DWORD format */
  struct {
    /* 1st DWORD - First Command Sequence */
    struct {
      uint32_t Byte3CommandSequence:8;
      uint32_t Byte2CommandSequence:8;
      uint32_t Byte1CommandSequence:8;
      uint32_t LengthCommand:8;
    } D1;
    /* 2nd DWORD - First Command Sequence (continued)*/
    struct {
      uint32_t Byte7CommandSequence:8;
      uint32_t Byte6CommandSequence:8;
      uint32_t Byte5CommandSequence:8;
      uint32_t Byte4CommandSequence:8;
    } D2;
    /* 1st DWORD - Second Command Sequence */
    struct {
      uint32_t Byte3CommandSequence:8;
      uint32_t Byte2CommandSequence:8;
      uint32_t Byte1CommandSequence:8;
      uint32_t LengthCommand:8;
    } D3;
    /* 2nd DWORD - Second Command Sequence (continued)*/
    struct {
      uint32_t Byte7CommandSequence:8;
      uint32_t Byte6CommandSequence:8;
      uint32_t Byte5CommandSequence:8;
      uint32_t Byte4CommandSequence:8;
    } D4;
    /* 1st DWORD - third Command Sequence */
    struct {
      uint32_t Byte3CommandSequence:8;
      uint32_t Byte2CommandSequence:8;
      uint32_t Byte1CommandSequence:8;
      uint32_t LengthCommand:8;
    } D5;
    /* 2nd DWORD - third Command Sequence (continued)*/
    struct {
      uint32_t Byte7CommandSequence:8;
      uint32_t Byte6CommandSequence:8;
      uint32_t Byte5CommandSequence:8;
      uint32_t Byte4CommandSequence:8;
    } D6;
    /* 1st DWORD - fourth Command Sequence */
    struct {
      uint32_t Byte3CommandSequence:8;
      uint32_t Byte2CommandSequence:8;
      uint32_t Byte1CommandSequence:8;
      uint32_t LengthCommand:8;
    } D7;
    /* 2nd DWORD - fourth Command Sequence (continued)*/
    struct {
      uint32_t Byte7CommandSequence:8;
      uint32_t Byte6CommandSequence:8;
      uint32_t Byte5CommandSequence:8;
      uint32_t Byte4CommandSequence:8;
    } D8;
  } Param_DWORD;
} SFDP_JEDEC_OCTALDDR; /* contains the command codes used in 8D-8D-8D protocol mode */

/**
 * @brief SFDP JEDEC SCCR Params definition
 */
typedef union {
  uint8_t  data_b[28*4];     /*!< data in byte format */
  uint32_t data_DWORD[28];   /*!< data in DWORD format */
  struct {

    uint32_t AddressOffsetVolatileRegister;
    uint32_t AddressOffsetNonVolatileRegister;


