IMProject/IMBootloader/Middlewares/ST/STM32_ExtMem_Manager/nor_sfdp/stm32_sfdp_data.c
    /* Generic Addressable Read/Write Status/Control register commands for volatile registers */
    struct {
      uint32_t NbDummyCyclesReadStatusControlRegisterCommandForVolatileRegisters_1S1S1S:4;
      uint32_t :2;
      uint32_t NbDummyCyclesReadRegisterCmdVolatileRegister_8D8D8D_mode:4;
      uint32_t NbDummyCyclesReadRegisterCmdVolatileRegister_8S8S8S_mode:4;
      uint32_t NbDummyCyclesReadRegisterCmdVolatileRegister_4S4D4D_mode:4;
      uint32_t NbDummyCyclesReadRegisterCmdVolatileRegister_4S4S4S_mode:4;
      uint32_t NbDummyCyclesReadRegisterCmdVolatileRegister_2S2S2S_mode:4;
      uint32_t NbDummyCyclesReadRegisterCmdVolatileRegister_1S1S1S_mode:2;

      uint32_t NbAddressBytesGenericAddressableReadWriteStatusControlRegisterCommandsVolatileRegisters:2;
      uint32_t GenericAddressableWriteRegisterCmdVolatileRegister_support:1;
      uint32_t GenericAddressableReadRegisterCmdVolatileRegister_support:1;
    } D3;
    /* Generic Addressable Read/Write Status/Control register commands for non-volatile registers */
    struct {
      uint32_t NbDummyCyclesReadStatusControlRegisterCommandForNVolatileRegisters_1S1S1S:4;
      uint32_t :2;
      uint32_t NbDummyCyclesReadRegisterCmdNonVolatileRegister_8D8D8D_mode:4;
      uint32_t NbDummyCyclesReadRegisterCmdNonVolatileRegister_8S8S8S_mode:4;
      uint32_t NbDummyCyclesReadRegisterCmdNonVolatileRegister_4S4D4D_mode:4;
      uint32_t NbDummyCyclesReadRegisterCmdNonVolatileRegister_4S4S4S_mode:4;
      uint32_t NbDummyCyclesReadRegisterCmdNonVolatileRegister_2S2S2S_mode:4;
      uint32_t NbDummyCyclesReadRegisterCmdNonVolatileRegister_1S1S1S_mode:2;

      uint32_t NbAddressBytesGenericAddressableReadWriteStatusControlRegisterCommandsNVolatileRegisters:2;
      uint32_t GenericAddressableWriteRegisterCmdNonVolatileRegister_support:1;
      uint32_t GenericAddressableReadRegisterCmdNonVolatileRegister_support:1;
    } D4;
    /* WIP (Required for xSPI) */
    struct {
      uint32_t CommandWriteAccess:8;
      uint32_t CommandReadAccess:8;
      uint32_t AddressRegisterOrModesSupported:8; /*  If Bit 28 is 1: Address of register where bit is located
                                                      Local address AAAA-AAAA
                                                      If Bit 28 is 0: Modes supported and dummy cycles used for direct command
                                                  */
      uint8_t  WIPBitLocationRegister:3;
      uint32_t LocalAddressForWIP:1;
      uint32_t BitAccessedByCommandsUsingAddress:1;
      uint32_t :1;
      uint32_t WIPpolarity:1;
      uint32_t WIPBitAvailable:1;
    } D5;
    /* WEL */
    struct {
      uint32_t CommandWriteAccess:8;
      uint32_t CommandReadAccess:8;
      uint32_t AddressRegisterOrModesSupported:8; /*  If Bit 28 is 1: Address of register where bit is located
                                                      Local address AAAA-AAAA
                                                      If Bit 28 is 0: Modes supported and dummy cycles used for direct command
                                                  */
      uint8_t  WELBitLocationRegister:3;
      uint32_t WELLocalAddress:1;
      uint32_t BitAccessedByCommandsUsingAddress:1;
      uint32_t WELWriteAccessBit:1;
      uint32_t WELpolarity:1;
      uint32_t WELBitAvailable:1;
    } D6;
    /* Program Error */
    struct {
      uint32_t CommandWriteAccess:8;
      uint32_t CommandReadAccess:8;
      uint32_t AddressRegisterOrModesSupported:8; /*  If Bit 28 is 1: Address of register where bit is located
                                                      Local address AAAA-AAAA
                                                      If Bit 28 is 0: Modes supported and dummy cycles used for direct command
                                                  */
      uint8_t  BitLocationRegister:3;
      uint32_t LocalAddress:1;
      uint32_t BitAccessedByCommandsUsingAddress:1;
      uint32_t Sharing:1;
      uint32_t Polarity:1;
      uint32_t BitAvailable:1;
    } D7;
    /* Erase Error */
    struct {
      uint32_t CommandWriteAccess:8;
      uint32_t CommandReadAccess:8;
      uint32_t AddressRegisterOrModesSupported:8; /*  If Bit 28 is 1: Address of register where bit is located
                                                      Local address AAAA-AAAA
                                                      If Bit 28 is 0: Modes supported and dummy cycles used for direct command
                                                  */
      uint8_t  BitLocationRegister:3;
      uint32_t LocalAddress:1;
      uint32_t BitAccessedByCommandsUsingAddress:1;
      uint32_t Sharing:1;
      uint32_t Polarity:1;
      uint32_t BitAvailable:1;
    } D8;
    /* 9th DWORD * Variable Dummy Cycle Settings * Volatile Register */
    struct {
      uint32_t CommandWriteAccess:8;
      uint32_t CommandReadAccess:8;
      uint32_t AddressRegisterOrModesSupported:8; /*  If Bit 28 is 1: Address of register where bit is located
                                                      Local address AAAA-AAAA
                                                      If Bit 28 is 0: Modes supported and dummy cycles used for direct command
                                                  */
      uint8_t  BitLocationLSBPhysicalBitsRegister:3;
      uint32_t LocalAddress:1;
      uint32_t BitAccessedByCommandsUsingAddress:1;
      uint32_t NumberBitsUsedToSetWaitStates:2;
      uint32_t BitAvailable:1;
    } D9;
    /* 10th DWORD * Variable Dummy Cycle Settings * Non Volatile Register */
    struct {
      uint32_t CommandWriteAccess:8;
      uint32_t CommandReadAccess:8;
      uint32_t AddressRegisterOrModesSupported:8; /*  If Bit 28 is 1: Address of register where bit is located
                                                      Local address AAAA-AAAA
                                                      If Bit 28 is 0: Modes supported and dummy cycles used for direct command
                                                  */
      uint8_t  BitLocationLSBPhysicalBitsRegister:3;
      uint32_t LocalAddress:1;
      uint32_t BitAccessedByCommandsUsingAddress:1;
      uint32_t NumberBitsUsedToSetWaitStates:2;
      uint32_t BitAvailable:1;
    } D10;
    /* 11th DWORD * Variable Dummy Cycle Settings * bit patterns */
    struct {
      uint32_t :2;
      uint32_t BitPatternUsedToSet_22DummyCycles:5;
      uint32_t Support_22DummyCycles:1;
      uint32_t BitPatternUsedToSet_24DummyCycles:5;
      uint32_t Support_24DummyCycles:1;
      uint32_t BitPatternUsedToSet_26DummyCycles:5;
      uint32_t Support_26DummyCycles:1;
      uint32_t BitPatternUsedToSet_28DummyCycles:5;
      uint32_t Support_28DummyCycles:1;
      uint32_t BitPatternUsedToSet_30DummyCycles:5;
      uint32_t Support_30DummyCycles:1;
    } D11;
    /* 12th DWORD * Variable Dummy Cycle Settings * bit patterns */
    struct {
      uint32_t :2;
      uint32_t BitPatternUsedToSet_12DummyCycles:5;
      uint32_t Support_12DummyCycles:1;
      uint32_t BitPatternUsedToSet_14DummyCycles:5;
      uint32_t Support_14DummyCycles:1;
      uint32_t BitPatternUsedToSet_16DummyCycles:5;
      uint32_t Support_16DummyCycles:1;
      uint32_t BitPatternUsedToSet_18DummyCycles:5;
      uint32_t Support_18DummyCycles:1;
      uint32_t BitPatternUsedToSet_20DummyCycles:5;
      uint32_t Support_20DummyCycles:1;
    } D12;
    /* 13th DWORD * Variable Dummy Cycle Settings * bit patterns */
    struct {
      uint32_t :2;
      uint32_t BitPatternUsedToSet_2DummyCycles:5;
      uint32_t Support_2DummyCycles:1;
      uint32_t BitPatternUsedToSet_4DummyCycles:5;
      uint32_t Support_4DummyCycles:1;
      uint32_t BitPatternUsedToSet_6DummyCycles:5;
      uint32_t Support_6DummyCycles:1;
      uint32_t BitPatternUsedToSet_8DummyCycles:5;
      uint32_t Support_8DummyCycles:1;
      uint32_t BitPatternUsedToSet_10DummyCycles:5;
      uint32_t Support_10DummyCycles:1;
    } D13;
    /* 14th DWORD * QPI Mode Enable Volatile */
    struct {
      uint32_t CommandWriteAccess:8;
      uint32_t CommandReadAccess:8;
      uint32_t AddressRegisterOrModesSupported:8; /*  If Bit 28 is 1: Address of register where bit is located
                                                      Local address AAAA-AAAA
                                                      If Bit 28 is 0: Modes supported and dummy cycles used for direct command
                                                  */
      uint8_t  BitLocationRegister:3;
      uint32_t LocalAddress:1;
      uint32_t BitAccessedByCommandsUsingAddress:1;
      uint32_t :1;
      uint32_t BitPolarity:1;
      uint32_t BitAvailable:1;
    } D14;
    /* 15th DWORD * QPI Mode Enable - Non Volatile */
    struct {
      uint32_t CommandWriteAccess:8;
      uint32_t CommandReadAccess:8;
      uint32_t AddressRegisterOrModesSupported:8; /*  If Bit 28 is 1: Address of register where bit is located
                                                      Local address AAAA-AAAA
                                                      If Bit 28 is 0: Modes supported and dummy cycles used for direct command
                                                  */
      uint8_t  BitLocationRegister:3;
      uint32_t LocalAddress:1;
      uint32_t BitAccessedByCommandsUsingAddress:1;
      uint32_t :1;
      uint32_t BitPolarity:1;
      uint32_t BitAvailable:1;
    } D15;
    /* 16th DWORD * Octal Mode Enable Volatile */
    struct {
      uint32_t CommandWriteAccess:8;
      uint32_t CommandReadAccess:8;
      uint32_t AddressRegisterOrModesSupported:8; /*  If Bit 28 is 1: Address of register where bit is located
                                                      Local address AAAA-AAAA
                                                      If Bit 28 is 0: Modes supported and dummy cycles used for direct command
                                                  */
      uint8_t  BitLocationRegister:3;
      uint32_t LocalAddress:1;
      uint32_t BitAccessedByCommandsUsingAddress:1;
      uint32_t :1;
      uint32_t BitPolarity:1;
      uint32_t BitAvailable:1;
    } D16;
    /* 17th DWORD * Octal Mode Enable - Non Volatile */
    struct {
      uint32_t CommandWriteAccess:8;
      uint32_t CommandReadAccess:8;
      uint32_t AddressRegisterOrModesSupported:8; /*  If Bit 28 is 1: Address of register where bit is located
                                                      Local address AAAA-AAAA
                                                      If Bit 28 is 0: Modes supported and dummy cycles used for direct command
                                                  */
      uint8_t  BitLocationRegister:3;
      uint32_t LocalAddress:1;
      uint32_t BitAccessedByCommandsUsingAddress:1;
      uint32_t :1;
      uint32_t BitPolarity:1;
      uint32_t BitAvailable:1;
    } D17;
    /* 18th DWORD * STR or DTR mode select * Volatile */
    struct {
      uint32_t CommandWriteAccess:8;
      uint32_t CommandReadAccess:8;
      uint32_t AddressRegisterOrModesSupported:8; /*  If Bit 28 is 1: Address of register where bit is located
                                                      Local address AAAA-AAAA
                                                      If Bit 28 is 0: Modes supported and dummy cycles used for direct command
                                                  */
      uint8_t  BitLocationRegister:3;
      uint32_t LocalAddress:1;
      uint32_t BitAccessedByCommandsUsingAddress:1;
      uint32_t :1;
      uint32_t BitPolarity:1;
      uint32_t BitAvailable:1;
    } D18;
    /* 19th DWORD * STR or DTR mode select * Non Volatile */
    struct {
      uint32_t CommandWriteAccess:8;
      uint32_t CommandReadAccess:8;
      uint32_t AddressRegisterOrModesSupported:8; /*  If Bit 28 is 1: Address of register where bit is located
                                                      Local address AAAA-AAAA
                                                      If Bit 28 is 0: Modes supported and dummy cycles used for direct command
                                                  */
      uint8_t  BitLocationRegister:3;
      uint32_t LocalAddress:1;
      uint32_t BitAccessedByCommandsUsingAddress:1;
      uint32_t :1;
      uint32_t BitPolarity:1;
      uint32_t BitAvailable:1;
    } D19;
    /* 20th DWORD * STR Octal Mode Enable * Volatile */
    struct {
      uint32_t CommandWriteAccess:8;
      uint32_t CommandReadAccess:8;
      uint32_t AddressRegisterOrModesSupported:8; /*  If Bit 28 is 1: Address of register where bit is located
                                                      Local address AAAA-AAAA
                                                      If Bit 28 is 0: Modes supported and dummy cycles used for direct command
                                                  */
      uint8_t  BitLocationRegister:3;
      uint32_t LocalAddress:1;
      uint32_t BitAccessedByCommandsUsingAddress:1;
      uint32_t :1;
      uint32_t BitPolarity:1;
      uint32_t BitAvailable:1;
    } D20;
    /* 21th DWORD * STR Octal Mode Enable * Non Volatile */
    struct {
      uint32_t CommandWriteAccess:8;
      uint32_t CommandReadAccess:8;
      uint32_t AddressRegisterOrModesSupported:8; /*  If Bit 28 is 1: Address of register where bit is located
                                                      Local address AAAA-AAAA
                                                      If Bit 28 is 0: Modes supported and dummy cycles used for direct command
                                                  */
      uint8_t  BitLocationRegister:3;
      uint32_t LocalAddress:1;
      uint32_t BitAccessedByCommandsUsingAddress:1;
      uint32_t :1;
      uint32_t BitPolarity:1;
      uint32_t BitAvailable:1;
    } D21;
    /* 22th DWORD * DTR Octal Mode Enable * Volatile */
    struct {
      uint32_t CommandWriteAccess:8;
      uint32_t CommandReadAccess:8;
      uint32_t AddressRegisterOrModesSupported:8; /*  If Bit 28 is 1: Address of register where bit is located
                                                      Local address AAAA-AAAA
                                                      If Bit 28 is 0: Modes supported and dummy cycles used for direct command
                                                  */
      uint8_t  BitLocationRegister:3;
      uint32_t LocalAddress:1;
      uint32_t BitAccessedByCommandsUsingAddress:1;
      uint32_t :1;
      uint32_t BitPolarity:1;
      uint32_t BitAvailable:1;
    } D22;
    /* 23th DWORD * DTR Octal Mode Enable * Non Volatile */
    struct {
      uint32_t CommandWriteAccess:8;
      uint32_t CommandReadAccess:8;
      uint32_t AddressRegisterOrModesSupported:8; /*  If Bit 28 is 1: Address of register where bit is located
                                                      Local address AAAA-AAAA
                                                      If Bit 28 is 0: Modes supported and dummy cycles used for direct command
                                                  */
      uint8_t  BitLocationRegister:3;
      uint32_t LocalAddress:1;
      uint32_t BitAccessedByCommandsUsingAddress:1;
      uint32_t :1;
      uint32_t BitPolarity:1;
      uint32_t BitAvailable:1;
    } D23;
    /* 24th DWORD * DPD Status */
    struct {
      uint32_t CommandWriteAccess:8;
      uint32_t CommandReadAccess:8;
      uint32_t AddressRegisterOrModesSupported:8; /*  If Bit 28 is 1: Address of register where bit is located
                                                      Local address AAAA-AAAA
                                                      If Bit 28 is 0: Modes supported and dummy cycles used for direct command
                                                  */
      uint8_t  BitLocationRegister:3;
      uint32_t LocalAddress:1;
      uint32_t BitAccessedByCommandsUsingAddress:1;
      uint32_t :1;
      uint32_t BitPolarity:1;
      uint32_t BitAvailable:1;
    } D24;
    /* 25th DWORD * UDPD Status */
    struct {
      uint32_t CommandWriteAccess:8;
      uint32_t CommandReadAccess:8;
      uint32_t AddressRegisterOrModesSupported:8; /*  If Bit 28 is 1: Address of register where bit is located
                                                      Local address AAAA-AAAA
                                                      If Bit 28 is 0: Modes supported and dummy cycles used for direct command
                                                  */
      uint8_t  BitLocationRegister:3;
      uint32_t LocalAddress:1;
      uint32_t BitAccessedByCommandsUsingAddress:1;
      uint32_t :1;
      uint32_t BitPolarity:1;
      uint32_t BitAvailable:1;
    } D25;
    /* 26th DWORD * Output Driver Strength - Volatile */
    struct {
      uint32_t CommandWriteAccess:8;
      uint32_t CommandReadAccess:8;
      uint32_t AddressRegisterOrModesSupported:8; /*  If Bit 28 is 1: Address of register where bit is located
                                                      Local address AAAA-AAAA
                                                      If Bit 28 is 0: Modes supported and dummy cycles used for direct command
                                                  */
      uint8_t  BitLocationRegister:3;
      uint32_t LocalAddress:1;
      uint32_t BitAccessedByCommandsUsingAddress:1;
      uint32_t :1;
      uint32_t NumberOfPhysicalBits:2;
    } D26;
    /* 27th DWORD * Output Driver Strength - Non Volatile */
    struct {
      uint32_t CommandWriteAccess:8;
      uint32_t CommandReadAccess:8;
      uint32_t AddressRegisterOrModesSupported:8; /*  If Bit 28 is 1: Address of register where bit is located
                                                      Local address AAAA-AAAA
                                                      If Bit 28 is 0: Modes supported and dummy cycles used for direct command
                                                  */
      uint8_t  BitLocationRegister:3;
      uint32_t LocalAddress:1;
      uint32_t BitAccessedByCommandsUsingAddress:1;
      uint32_t :1;
      uint32_t NumberOfPhysicalBits:2;
    } D27;
    /* 27th DWORD * Output Driver Strength - Non Volatile */
    struct {
      uint32_t :16;
      uint32_t BitPatternSupportDriverType4 :3;
      uint32_t BitPatternSupportDriverType3 :3;
      uint32_t BitPatternSupportDriverType2 :3;
      uint32_t BitPatternSupportDriverType1 :3;
      uint32_t BitPatternSupportDriverType0 :3;
    } D28;


  } Param_DWORD;
} SFDP_JEDEC_SCCR_Map; /* contains the command codes used in 8D-8D-8D protocol mode */

/**
  * @}
  */

/* Private variables ---------------------------------------------------------*/
/** @defgroup NOR_SFDP_DATA_Private_Variables Private Variables
  * @{
  */
/**
 * @brief this variable contains all the table available on a memory
 */
static SFDP_ParameterTableTypeDef     sfdp_param_info[SFDP_MAX_NB_OF_PARAM];

/**
 * @brief this variable contains the JEDEC basic table info
 */
static SFDP_JEDECBasic_Params         JEDEC_Basic = {0};

/**
 * @brief this variable contains the JEDEC address 4-Byte address table info
 */
static SFDP_JEDEC4ByteAddress_Params  JEDEC_Address4Bytes = {0};

/**
 * @brief this variable contains the JEDEC XSPIV1.0 table info
 */
static SFDP_JEDEC_XSPI10              JEDEC_XSPI10;

/**
 * @brief this variable contains the JEDEC SCCR table info
 */
static SFDP_JEDEC_SCCR_Map            JEDEC_SCCR_Map;

/**
 * @brief this variable contains the JEDEC octal DDR table info
 */
static SFDP_JEDEC_OCTALDDR            JEDEC_OctalDdr;






/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/
/** @defgroup NOR_SFDP_DATA_Private_Functions Private Functions
  * @{
  */
SFDP_StatusTypeDef sfdp_get_paraminfo(EXTMEM_DRIVER_NOR_SFDP_ObjectTypeDef *Object, uint32_t sfdp_address, SFDP_ParameterTableTypeDef *Param_info);
SFDP_StatusTypeDef sfdp_enter_octal_mode(EXTMEM_DRIVER_NOR_SFDP_ObjectTypeDef *Object);
uint32_t sfdp_getfrequencevalue(uint32_t BitField);
SFDP_StatusTypeDef sfdp_set_dummycycle(EXTMEM_DRIVER_NOR_SFDP_ObjectTypeDef *Object, uint32_t Value);
/**
  * @}
  */

/** @defgroup NOR_SFDP_DATA_Private_JEDEC_Functions Private Functions for JEDEC decoding
  * @{
  */
SFDP_StatusTypeDef JEDEC_Basic_ManageQuadEnableRequirement(EXTMEM_DRIVER_NOR_SFDP_ObjectTypeDef *Object);
SFDP_StatusTypeDef JEDEC_Basic_Manage4S4S4SEnableSequence(EXTMEM_DRIVER_NOR_SFDP_ObjectTypeDef *Object);

/** @defgroup NOR_SFDP_DATA_Private_Singature_Functions Private Functions for SFDP signature
  * @{
  */
SFDP_StatusTypeDef CheckSFDP_Signature(EXTMEM_DRIVER_NOR_SFDP_ObjectTypeDef *Object, uint32_t Signature );
/**
  * @}
  */


/** @defgroup NOR_SFDP_DATA_Exported_Functions Exported Functions
  * @{
  */

/**
 * @brief This function reads and checks the SFDP header and adjusts
 * @param Object memory Object
 * @param sfdp_header data of the SFDP header
 * @return @ref SFDP_StatusTypeDef
 */
SFDP_StatusTypeDef SFDP_ReadHeader(EXTMEM_DRIVER_NOR_SFDP_ObjectTypeDef *Object, SFDP_HeaderTypeDef *sfdp_header)
{
  SFDP_StatusTypeDef retr;
  uint8_t retry_counter = 0;
  SFDP_DEBUG_STR(__func__);

  do {
    /* Reset the signature value */
    sfdp_header->Signature = 0;

    /* send the SFDP command to read the header */
    if(HAL_OK != SAL_XSPI_GetSFDP(&Object->sfdp_private.SALObject, 0, (uint8_t*)sfdp_header, SFDP_HEADER_SIZE))
    {
      retr = EXTMEM_SFDP_ERROR_SFDPREAD;
      goto error;
    }

    /* view the header signature value  */
    SFDP_DEBUG_INT("SFDP signature::", sfdp_header->Signature);

    switch(CheckSFDP_Signature(Object, sfdp_header->Signature))
    {
    case EXTMEM_SFDP_OK:
      SFDP_DEBUG_INT("param_number=", sfdp_header->param_number);
      SFDP_DEBUG_INT("AccessProtocol=", sfdp_header->AccessProtocol);
      retr = EXTMEM_SFDP_OK;
      retry_counter = 2u;
    break;
    case EXTMEM_SFDP_ERROR_SIGNATUREMTYPE:
      retr = EXTMEM_SFDP_ERROR_SIGNATURE;
      retry_counter++;
      break;
    /* case EXTMEM_SFDP_ERROR_SIGNATURE :*/
    default :
      retr = EXTMEM_SFDP_ERROR_SIGNATURE;
      retry_counter = 2u;
      break;
    }
  } while(retry_counter < 2u);

error:
  return retr;
}


SFDP_StatusTypeDef SFDP_GetHeader(EXTMEM_DRIVER_NOR_SFDP_ObjectTypeDef *Object, SFDP_HeaderTypeDef *sfdp_header)
{
  SFDP_StatusTypeDef retr = EXTMEM_SFDP_ERROR_SIGNATURE;
  SFDP_DEBUG_STR(__func__);
  const TableConfig_Typedef table_config[] =
  {
    {PHY_LINK_1S1S1S, 8u},
    {PHY_LINK_4S4S4S, 2u},
    {PHY_LINK_4S4S4S, 8u},
    {PHY_LINK_4S4S4S, 6u},
    {PHY_LINK_8D8D8D, 8u},
    {PHY_LINK_8D8D8D, 20u},
    {PHY_LINK_8D8D8D, 10u},
    {PHY_LINK_8D8D8D, 16u}
  };

  /* loop to find the link configuration of the memory */
  for (uint8_t index = 0u;
       (index < (sizeof(table_config)/sizeof(TableConfig_Typedef))) &&
       (retr == EXTMEM_SFDP_ERROR_SIGNATURE)
           ; index++)
  {
    /* Set the command mode */
    SFDP_DEBUG_STR("try a command configuration");

    /* Configure the link */
    Object->sfdp_private.DriverInfo.SpiPhyLink  = table_config[index].PhyLink;
    (void)SAL_XSPI_MemoryConfig(&Object->sfdp_private.SALObject, PARAM_PHY_LINK, &Object->sfdp_private.DriverInfo.SpiPhyLink);
    SAL_XSPI_SET_SFDPDUMMYCYLE(Object->sfdp_private.SALObject, table_config[index].DummyCycle);

    /* Loop on the instruction extension */
    for (uint8_t IExt = 0u;
         (IExt < 2u) && (retr == EXTMEM_SFDP_ERROR_SIGNATURE); IExt++)
    {
      SAL_XSPI_SET_COMMANDEXTENSION(Object->sfdp_private.SALObject, IExt);
      /* Read the sfdp header */
      if (EXTMEM_SFDP_OK == SFDP_ReadHeader(Object, sfdp_header))
      {
        retr = EXTMEM_SFDP_OK;
      }

      if (table_config[index].PhyLink < PHY_LINK_4S4S4S)
      {
        /* Config 1 is invalid so exit the loop */
        break;
      }
    }
  }
  return retr;
}

