IMProject/IMBootloader/Middlewares/ST/STM32_ExtMem_Manager/nor_sfdp/stm32_sfdp_data.c
    /* WEL */
    if (0u != JEDEC_SCCR_Map.Param_DWORD.D6.WELBitAvailable)
    {
      Object->sfdp_private.DriverInfo.ReadWELCommand  = (uint8_t)JEDEC_SCCR_Map.Param_DWORD.D6.CommandReadAccess;
      Object->sfdp_private.DriverInfo.WELPosition     = JEDEC_SCCR_Map.Param_DWORD.D6.WELBitLocationRegister;
      Object->sfdp_private.DriverInfo.WELBusyPolarity = (uint8_t)JEDEC_SCCR_Map.Param_DWORD.D6.WELpolarity;
      Object->sfdp_private.DriverInfo.WELPosition     = JEDEC_SCCR_Map.Param_DWORD.D6.WELBitLocationRegister;

      if (0u != JEDEC_SCCR_Map.Param_DWORD.D5.BitAccessedByCommandsUsingAddress)
      {
        /* Address management */
        Object->sfdp_private.DriverInfo.WELAddress  = (uint8_t)JEDEC_SCCR_Map.Param_DWORD.D6.WELLocalAddress;
      }
      else
      {
        /* in that case there is no address to manage, the value EXTMEM_ADDRESS_NONE is used to detect the difference */
        Object->sfdp_private.DriverInfo.WELAddress = EXTMEM_ADDRESS_NONE;
      }
    }
  }
  else
  {
      Object->sfdp_private.DriverInfo.WELPosition     = 1;
      Object->sfdp_private.DriverInfo.WELBusyPolarity = 0;

      /*
       *   WIP : Status register read management
       *         Basic D14 Status register Polling device Busy
       */
      if (0x01u == (JEDEC_Basic.Params.Param_DWORD.D14.StatusRegister &  0x01u))
      {
        /* xx_xxx1b: Use of legacy polling is supported by reading the Status Register with 05h instruction
           and checking WIP bit[0] (0=ready; 1=busy). */
        Object->sfdp_private.DriverInfo.ReadWIPCommand = SFDP_DRIVER_READ_STATUS_REGISTER_COMMAND;
        Object->sfdp_private.DriverInfo.WIPPosition = 0u;
        Object->sfdp_private.DriverInfo.WIPBusyPolarity = 0u;
      }
      else if (0x02u == (JEDEC_Basic.Params.Param_DWORD.D14.StatusRegister &  0x02u))
      {
        /* xx_xx1xb: Bit 7 of the Flag Status Register may be polled any time a Program, Erase, Suspend/Resume
           command is issued, or after a Reset command while the device is busy. The read instruction is 70h.
           Flag Status Register bit definitions: bit[7]: Program or erase controller status (0=busy; 1=ready)*/
        Object->sfdp_private.DriverInfo.ReadWIPCommand = 0x70;
        Object->sfdp_private.DriverInfo.WIPPosition = 7u;
        Object->sfdp_private.DriverInfo.WIPBusyPolarity = 0u;
      }
      else
      {
          retr = EXTMEM_SFDP_ERROR_JEDECBASIC_D14;
          goto error;
      }
  }

  /* Set default value for Read instruction */
  Object->sfdp_private.DriverInfo.ReadInstruction     = SFDP_DRIVER_READ_COMMAND;

  /* ---------------------------------------------------
   *  command based on SFDP_PARAMID_BASIC_SPIPROTOCOL
   * ---------------------------------------------------
   */
  if (((Object->sfdp_private.Sfdp_table_mask & (uint32_t)SFDP_PARAMID_BASIC_SPIPROTOCOL)
       == (uint32_t)SFDP_PARAMID_BASIC_SPIPROTOCOL)
      && (Object->sfdp_private.Config < EXTMEM_LINK_CONFIG_8LINES))
  {
    dummyCycles = 0;
    Object->sfdp_private.DriverInfo.SpiPhyLink = PHY_LINK_1S1S1S;

    if (Object->sfdp_private.Config > EXTMEM_LINK_CONFIG_1LINE)
    {
      /* control if read 1s1s2s is available */
      if (JEDEC_Basic.Params.Param_DWORD.D4._1S1S2S_FastReadInstruction != 0u)
      {
        dummyCycles = JEDEC_Basic.Params.Param_DWORD.D4._1S1S2S_DummyClock + JEDEC_Basic.Params.Param_DWORD.D4._1S1S2S_ModeClock;
        Object->sfdp_private.DriverInfo.ReadInstruction = (uint8_t)JEDEC_Basic.Params.Param_DWORD.D4._1S1S2S_FastReadInstruction;
        Object->sfdp_private.DriverInfo.SpiPhyLink = PHY_LINK_1S1S2S;
      }

      /* control if read 1S2S2S is available */
      if (JEDEC_Basic.Params.Param_DWORD.D4._1S2S2S_FastReadInstruction != 0u)
      {
        dummyCycles = JEDEC_Basic.Params.Param_DWORD.D4._1S2S2S_DummyClock + JEDEC_Basic.Params.Param_DWORD.D4._1S2S2S_ModeClock;
        Object->sfdp_private.DriverInfo.ReadInstruction = (uint8_t)JEDEC_Basic.Params.Param_DWORD.D4._1S2S2S_FastReadInstruction;
        Object->sfdp_private.DriverInfo.SpiPhyLink = PHY_LINK_1S2S2S;
      }

      /* The memory work only in 2S2S2S */
      if (JEDEC_Basic.Params.Param_DWORD.D5._2S2S2S_FastReadSupport != 0u)
      {
        dummyCycles = JEDEC_Basic.Params.Param_DWORD.D6._2S2S2S_DummyClock + JEDEC_Basic.Params.Param_DWORD.D6._2S2S2S_ModeClock;
        Object->sfdp_private.DriverInfo.ReadInstruction = (uint8_t)JEDEC_Basic.Params.Param_DWORD.D6._2S2S2S_FastReadInstruction;
      }
    }

    /* the command set is only based on this table */
    /* determine the best line configuration */
    if (Object->sfdp_private.Config > EXTMEM_LINK_CONFIG_2LINES)
    {
      if (JEDEC_Basic.Params.Param_DWORD.D5._4S4S4S_FastReadSupport != 0u)
      {
        dummyCycles = JEDEC_Basic.Params.Param_DWORD.D7._4S4S4S_DummyClock + JEDEC_Basic.Params.Param_DWORD.D7._4S4S4S_ModeClock;
        Object->sfdp_private.DriverInfo.ReadInstruction = (uint8_t)JEDEC_Basic.Params.Param_DWORD.D7._4S4S4S_FastReadInstruction;
        Object->sfdp_private.DriverInfo.SpiPhyLink = PHY_LINK_4S4S4S;

        retr = JEDEC_Basic_Manage4S4S4SEnableSequence(Object);
        if ( retr != EXTMEM_SFDP_OK)
        {
          goto error;
        }
      }
      else /* other configuration with more 4 lines */
      {
        /* not yet handled */
      }
      SAL_XSPI_SET_SFDPDUMMYCYLE(Object->sfdp_private.SALObject, (uint8_t)dummyCycles);

#if defined(IS25WP032D_ENABLE_DTR)
      /* Check support of DTR feature (DTR Support in D1) */
      if (JEDEC_Basic.Params.Param_DWORD.D1.Support_DTR == 1u)
      {
        /* Additional information regarding DTR read instruction and dummy cycles might be present in
             D21 : Fast Read (1S-1D-1D), (1S-2D-2D), (1S-4D-4D), and (4S-4D-4D) Support
              and
             D23 : Fast Read (1S-4D-4D) and (4S-4D-4D) Wait States, Mode Bit Clocks, and Instruction */
        /* Extract values for 4S4D4D */
        if (JEDEC_Basic.Params.Param_DWORD.D21._4S4D4D_FastReadSupport == 1u)
        {
          dummyCycles = JEDEC_Basic.Params.Param_DWORD.D23._4S4D4D_DummyClock + JEDEC_Basic.Params.Param_DWORD.D23._4S4D4D_ModeClock;
          Object->sfdp_private.DriverInfo.ReadInstruction = (uint8_t)JEDEC_Basic.Params.Param_DWORD.D23._4S4D4D_FastReadInstruction;
          Object->sfdp_private.DriverInfo.SpiPhyLink = PHY_LINK_4S4D4D;
        }
        else
        {
          /* Other specific cases to be managed : for example, when Basic Flash Parameter Table is not long enough
             and D21, ... are not provided by the card. Specific cases section might have to be updated when adding
             support for new memories whose SFDP paramter table is not complete */

          /* Specific case for ISSI memories */
          if (Object->sfdp_private.ManuID == EXTMEM_MANFACTURER_ISSI)   /* ISSI manufacturer ID */
          {
            dummyCycles = 6u;
            Object->sfdp_private.DriverInfo.ReadInstruction = 0x0D;
            Object->sfdp_private.DriverInfo.SpiPhyLink = PHY_LINK_4S4D4D;
            SAL_XSPI_SET_DTRREADDUMMYCYLE(Object->sfdp_private.SALObject, (uint8_t)dummyCycles);
          }

