IMProject/IMBootloader/Middlewares/ST/STM32_ExtMem_Manager/nor_sfdp/stm32_sfdp_data.c
    if (sfdp_param_header.ID_msb == SFDP_BASIC_PARAMETER_TABLE_MSB)
    {
      switch(sfdp_param_header.ID_lsb)
      {
      case SFDP_BASIC_PARAMETER_TABLE_LSB :
        Param_info->type = SFDP_PARAMID_BASIC_SPIPROTOCOL;
        SFDP_DEBUG_STR("-> info SFDP_PARAMID_BASIC_SPIPROTOCOL");
        Param_info->size = ((sfdp_param_header.Length ) < SFDP_PARAMS_BASIC_TABLE_DEFAULTSIZE)
                             ? sfdp_param_header.Length : SFDP_PARAMS_BASIC_TABLE_DEFAULTSIZE;
        break;
      case 0x81u:
        Param_info->type = SFDP_PARAMID_SECTORMAP;
        SFDP_DEBUG_STR("-> info SFDP_PARAMID_SECTORMAP");
        break;
      case 0x03u:
        Param_info->type = SFDP_PARAMID_RPMC;
        SFDP_DEBUG_STR("-> info SFDP_PARAMID_RPMC");
        break;
      case 0x84u:
        Param_info->type = SFDP_PARAMID_4BYTE_ADDRESS_INSTRUCTION;
        SFDP_DEBUG_STR("-> info SFDP_PARAMID_4BYTE_ADDRESS_INSTRUCTION");
        break;
      case 0x05u:
        Param_info->type = SFDP_PARAMID_XSPI_V1_0;
        SFDP_DEBUG_STR("-> info SFDP_PARAMID_XSPI_V1_0");
        break;
      case 0x06u:
        Param_info->type = SFDP_PARAMID_XSPI_V2_0;
        SFDP_DEBUG_STR("-> info SFDP_PARAMID_XSPI_V2_0");
        break;
      case 0x87u:
        Param_info->type = SFDP_PARAMID_STATUS_CONTROL_CONFIG_REGISTER_MAP;
        SFDP_DEBUG_STR("-> info SFDP_PARAMID_STATUS_CONTROL_CONFIG_REGISTER_MAP");
        break;
      case 0x88u:
        Param_info->type = SFDP_PARAMID_STATUS_CONTROL_CONFIG_REGISTER_MAP_MULTICHIP;
        SFDP_DEBUG_STR("-> info SFDP_PARAMID_STATUS_CONTROL_CONFIG_REGISTER_MAP_MULTICHIP");
        break;
      case 0x09u:
        Param_info->type = SFDP_PARAMID_STATUS_CONTROL_CONFIG_XSPI_V2_0;
        SFDP_DEBUG_STR("-> info SFDP_PARAMID_STATUS_CONTROL_CONFIG_XSPI_V2_0");
        break;
      case 0x0Au:
        Param_info->type = SFDP_PARAMID_OCTAL_DDR;
        SFDP_DEBUG_STR("-> info SFDP_PARAMID_OCTAL_DDR");
        break;
      case 0x8Bu:
        Param_info->type = SFDP_PARAMID_MSPT;
        SFDP_DEBUG_STR("-> info SFDP_PARAMID_MSPT");
        break;
      case 0x0Cu:
        Param_info->type = SFDP_PARAMID_X4QUAD_DS;
        SFDP_DEBUG_STR("-> info SFDP_PARAMID_X4QUAD_DS");
        break;
      case 0x8Du:
        Param_info->type = SFDP_PARAMID_QUAD_DDR;
        SFDP_DEBUG_STR("-> info SFDP_PARAMID_QUAD_DDR");
        break;
      case 0x8Eu:
        Param_info->type = SFDP_PARAMID_SECURE_PACKET_READ_WRITE;
        SFDP_DEBUG_STR("-> info SFDP_PARAMID_SECURE_PACKET_READ_WRITE");
        break;
      case 0x0Fu:
        Param_info->type = SFDP_PARAMID_RESERVED;
        SFDP_DEBUG_STR("-> info SFDP_PARAMID_RESERVED");
        break;
      default :
        SFDP_DEBUG_STR("-> info SFDP_PARAMID_????");
        break;
      }
    }

    if( Param_info->type == SFDP_PARAMID_UNKNOWN)
    {
      SFDP_DEBUG_STR("-> the table is not compliant with to JEDEC standard");
    }
  }
  else
  {
    /* Unexpected value for MSB field of SFDP Parameter ID */
    SFDP_DEBUG_STR("-> Unexpected value for MSB field of SFDP Parameter ID");
    retr = EXTMEM_SFDP_ERROR_SFDPREAD;
    goto error;
  }

error:
  return retr;
}

/**
 * @brief This function executes the octal DDR table to enter octal DDR mode
 * @param Object memory Object
 * @return @ref SFDP_StatusTypeDef
 */
SFDP_StatusTypeDef sfdp_enter_octal_mode(EXTMEM_DRIVER_NOR_SFDP_ObjectTypeDef *Object)
{
  SFDP_StatusTypeDef retr = EXTMEM_SFDP_OK;
  uint8_t data[7];
  SFDP_DEBUG_STR(__func__);
  /* D1-D2 command */
  if (0u != JEDEC_OctalDdr.Param_DWORD.D1.LengthCommand)
  {
    data[0] = (uint8_t)JEDEC_OctalDdr.Param_DWORD.D1.Byte1CommandSequence;
    data[1] = (uint8_t)JEDEC_OctalDdr.Param_DWORD.D1.Byte2CommandSequence;
    data[2] = (uint8_t)JEDEC_OctalDdr.Param_DWORD.D1.Byte3CommandSequence;
    data[3] = (uint8_t)JEDEC_OctalDdr.Param_DWORD.D2.Byte4CommandSequence;
    data[4] = (uint8_t)JEDEC_OctalDdr.Param_DWORD.D2.Byte5CommandSequence;
    data[5] = (uint8_t)JEDEC_OctalDdr.Param_DWORD.D2.Byte6CommandSequence;
    data[6] = (uint8_t)JEDEC_OctalDdr.Param_DWORD.D2.Byte7CommandSequence;

    if (HAL_OK != SAL_XSPI_CommandSendData(&Object->sfdp_private.SALObject, data[0], &data[1],
                                           (uint16_t)(JEDEC_OctalDdr.Param_DWORD.D1.LengthCommand - 1u)))
    {
      retr = EXTMEM_SFDP_ERROR_OCTALMODE;
      goto error;
    }
  }

  /* D3-D4 command */
  if (0u != JEDEC_OctalDdr.Param_DWORD.D3.LengthCommand)
  {
    /* wait for busy flag clear */
    if (EXTMEM_DRIVER_NOR_SFDP_OK != driver_check_FlagBUSY(Object, 100u))
    {
      retr = EXTMEM_SFDP_ERROR_DRIVER;
      goto error;
    }

    data[0] = (uint8_t)JEDEC_OctalDdr.Param_DWORD.D3.Byte1CommandSequence;
    data[1] = (uint8_t)JEDEC_OctalDdr.Param_DWORD.D3.Byte2CommandSequence;
    data[2] = (uint8_t)JEDEC_OctalDdr.Param_DWORD.D3.Byte3CommandSequence;
    data[3] = (uint8_t)JEDEC_OctalDdr.Param_DWORD.D4.Byte4CommandSequence;
    data[4] = (uint8_t)JEDEC_OctalDdr.Param_DWORD.D4.Byte5CommandSequence;
    data[5] = (uint8_t)JEDEC_OctalDdr.Param_DWORD.D4.Byte6CommandSequence;
    data[6] = (uint8_t)JEDEC_OctalDdr.Param_DWORD.D4.Byte7CommandSequence;

    if (HAL_OK != SAL_XSPI_CommandSendData(&Object->sfdp_private.SALObject, data[0], &data[1],
                                           (uint16_t)(JEDEC_OctalDdr.Param_DWORD.D3.LengthCommand - 1u)))
    {
      retr = EXTMEM_SFDP_ERROR_OCTALMODE;
      goto error;
    }
  }

  /* D5-D6 command */
  if (0u != JEDEC_OctalDdr.Param_DWORD.D5.LengthCommand)
  {
    /* wait for busy flag clear */
    if (EXTMEM_DRIVER_NOR_SFDP_OK != driver_check_FlagBUSY(Object, 100u))
    {
      retr = EXTMEM_SFDP_ERROR_DRIVER;
      goto error;
    }

    data[0] = (uint8_t)JEDEC_OctalDdr.Param_DWORD.D5.Byte1CommandSequence;
    data[1] = (uint8_t)JEDEC_OctalDdr.Param_DWORD.D5.Byte2CommandSequence;
    data[2] = (uint8_t)JEDEC_OctalDdr.Param_DWORD.D5.Byte3CommandSequence;
    data[3] = (uint8_t)JEDEC_OctalDdr.Param_DWORD.D6.Byte4CommandSequence;
    data[4] = (uint8_t)JEDEC_OctalDdr.Param_DWORD.D6.Byte5CommandSequence;
    data[5] = (uint8_t)JEDEC_OctalDdr.Param_DWORD.D6.Byte6CommandSequence;
    data[6] = (uint8_t)JEDEC_OctalDdr.Param_DWORD.D6.Byte7CommandSequence;

    if (HAL_OK != SAL_XSPI_CommandSendData(&Object->sfdp_private.SALObject, data[0], &data[1],
                                           (uint16_t)(JEDEC_OctalDdr.Param_DWORD.D5.LengthCommand - 1u)))
    {
      retr = EXTMEM_SFDP_ERROR_OCTALMODE;
      goto error;
    }
  }

  /* D7-D8 command */
  if (0u != JEDEC_OctalDdr.Param_DWORD.D7.LengthCommand)
  {
    /* wait for busy flag clear */
    if (EXTMEM_DRIVER_NOR_SFDP_OK != driver_check_FlagBUSY(Object, 100u))
    {
      retr = EXTMEM_SFDP_ERROR_DRIVER;
      goto error;
    }

